In [2]:
import pandas as pd

In [4]:
job_list = [
    {'name': 'John', 'job': 'teacher'},
    {'name': 'Nate', 'job': 'teacher'},
    {'name': 'Fred', 'job': 'teacher'},
    {'name': 'Abraham', 'job': 'student'},
    {'name': 'Brian', 'job': 'student'},
    {'name': 'Janny', 'job': 'developer'},
    {'name': 'Nate', 'job': 'teacher'},
    {'name': 'Ian', 'job': 'teacher'},
    {'name': 'Chris', 'job': 'banker'},
    {'name': 'Philip', 'job': 'lawyer'},
    {'name': 'Janny', 'job': 'basketball player'},
    {'name': 'Gwen', 'job': 'teacher'},
    {'name': 'Jessy', 'job': 'student'}
]
df = pd.DataFrame(job_list, columns=['name', 'job'])
df

       name                job
0      John            teacher
1      Nate            teacher
2      Fred            teacher
3   Abraham            student
4     Brian            student
5     Janny          developer
6      Nate            teacher
7       Ian            teacher
8     Chris             banker
9    Philip             lawyer
10    Janny  basketball player
11     Gwen            teacher
12    Jessy            student

In [5]:
# 컬럼 내 유니크 값 조회
df.job.unique()

array(['teacher', 'student', 'developer', 'banker', 'lawyer',
       'basketball player'], dtype=object)

In [6]:
# 컬럼 내 유니크 값별 개수 조회
df.job.value_counts()

teacher              6
student              3
developer            1
banker               1
lawyer               1
basketball player    1
Name: job, dtype: int64